BTN_CREATE = "✅ Создать новую заметку"
BTN_LIST = "📋 Список заметок"
TIME_TO_SCHEDULE = 1 * 60
ISO_REGEX = (
    r"^"
    r"(?P<year>\d{4})"  # Год (4 цифры)
    r"-(?P<month>0[1-9]|1[0-2])"  # Месяц (01-12)
    r"-(?P<day>0[1-9]|[12]\d|3[01])"  # День (01-31)
    r"T"  # Разделитель даты и времени
    r"(?P<hour>[01]\d|2[0-3])"  # Часы (00-23)
    r":(?P<minute>[0-5]\d)"  # Минуты (00-59)
    r"(?::(?P<second>[0-5]\d))?"  # Секунды (опционально, 00-59)
    r"(?:\.(?P<ms>\d+))?"  # Миллисекунды (опционально)
    r"(?P<tz>Z|[+-](?:0\d|1[0-4]):[0-5]\d)"  # Часовой пояс (Z или ±HH:MM)
    r"$"
)
